Revit 2024 API
MEPAnalyticalModelData.GetNumberOfNodes Method
 Returns the number of analytical nodes.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public int GetNumberOfNodes()
Visual Basic
Public Function GetNumberOfNodes As Integer
Visual C++
public:
int GetNumberOfNodes()
See Also
MEPAnalyticalModelData Class
Autodesk.Revit.DB.Analysis Namespace